[ViperBoss X2CharacterTemplate]
strCharacterName="Clone Gamma"

[BerserkerBoss X2CharacterTemplate]
strCharacterName="Clone Beta"

[ArchonBoss X2CharacterTemplate]
strCharacterName="Clone Alpha"

[ViperBossReaction X2AbilityTemplate]
LocFriendlyName="Inhuman Reflexes"
LocLongDescription="Viper Bosses are able to react to situations with inhuman agility."
LocHelpText="Rapid reactions."
LocFlyOverText="Inhuman Reflexes"

[BerserkerBossReaction X2AbilityTemplate]
LocFriendlyName="Inhuman Reflexes"
LocLongDescription="Berserker Bosses are able to react to situations with inhuman agility."
LocHelpText="Rapid reactions."
LocFlyOverText="Inhuman Reflexes"

[ArchonBossReaction X2AbilityTemplate]
LocFriendlyName="Inhuman Reflexes"
LocLongDescription="Archon Bosses are able to react to situations with inhuman agility."
LocHelpText="Rapid reactions."
LocFlyOverText="Inhuman Reflexes"

[CorpseViperBoss X2ItemTemplate]
FriendlyName="Clone Gamma Corpse"
FriendlyNamePlural="Clone Gamma Corpses"
BriefSummary="Although this specimen is merely a clone of the Viper King, it still have the original's potent ice producing glands." 

[CorpseBerserkerBoss X2ItemTemplate]
FriendlyName="Clone Beta Corpse"
FriendlyNamePlural="Clone Beta Corpses"
BriefSummary="This clone of the Berserker Queen retains not only it's strength, but also it's extraordinary temper. Extreme care should be taken when attempting to disconnect any of the embedded systems."

[CorpseArchonBoss X2ItemTemplate]
FriendlyName="Clone Alpha Corpse"
FriendlyNamePlural="Clone Alpha Corpses"
BriefSummary="Even though it's merely a clone of the Archon King, this creature is not to be underestimated even in death."

[IcarusArmor X2ArmorTemplate]
FriendlyName="Icarus Armor"
FriendlyNamePlural="Icarus Armors"
BriefSummary="The flight components recovered from the Archon King, when combined with our standard-issue armor systems, result in an armored suit with high damage resistance and improved mobility. The built-in propulsion system allows temporary flight, enabling the wearer to rapidly change locations."
TacticalText="<Bullet/> Icarus Armor is a medium-class armor, providing two inventory item slots and increased mobility.\n<Bullet/> The Icarus Armor allows a soldier to instantly leap to a new location.\n<Bullet/> Wearing this armor has a chance to panic Archons encountered in combat."

[SerpentArmorMk2 X2ArmorTemplate]
FriendlyName="Serpent Armor"
FriendlyNamePlural="Serpent Armors"
BriefSummary="An enhanced version of the Serpent Suit reinforced with Elerium, this armor maintains all of its predecessor's capabilities while further boosting the survivability, speed, and reflexes of the wearer."
TacticalText="<Bullet/> Serpent Armor adds mobility and an increased chance of taking grazing shots instead of outright hits.\n<Bullet/> Serpent Armor has a wrist-mounted grapple, which can be used for traversal or to pull enemy units out of cover.\n<Bullet/> Wearing this armor has a chance to panic Vipers encountered in combat."

[RAGEArmorMk2 X2ArmorTemplate]
FriendlyName="R.A.G.E. Armor"
FriendlyNamePlural="R.A.G.E. Armors"
BriefSummary="By injecting the R.A.G.E. Suit with additional Elerium, its protective qualities are improved while retaining its inherent mobility and potential for devastating melee assaults."
TacticalText="<Bullet/> R.A.G.E. Armor is a heavy-class armor, granting increased mobility and allowing a soldier to mount a heavy weapon.\n<Bullet/> R.A.G.E Armor allows to wearer to charge enemies and inflict brutal melee damage.\n<Bullet/> Wearing this armor has a chance to panic Mutons and Berserkers encountered in combat."

[BuildRAGEArmor X2TechTemplate]
DisplayName="Build R.A.G.E. Armor"
Summary="It may be possible to retrofit the exceptionally durable skin of the Berserker Queen clone into a high-powered body suit." 

[BuildSerpentArmor X2TechTemplate]
DisplayName="Build Serpent Armor"
Summary="The scales of the Viper King clone are surprisingly lightweight and flexible, and should provide substantial resistance once reinforced and infused with additional Elerium."

[BuildIcarusArmor X2TechTemplate]
DisplayName="Build Icarus Armor"
Summary="After careful examination of the deceased clone of the Archon King, it is feasible to construct a set of armor which incorporates his unique jet propulsion systems."
